{"ver":"0.1","info":{"id":"dlBSRz","date":"1675552889","viewed":97,"name":"Simple_Noise","username":"patrickhartono","description":"Simple Noise","likes":2,"published":1,"flags":0,"usePreview":0,"tags":["noise"],"hasliked":0,"parentid":"","parentname":""},"renderpass":[{"inputs":[],"outputs":[{"id":"4dfGRr","channel":0}],"code":"/*\n\nThe MIT License\n\nCopyright © 2023 Patrick Hartono\n\nPermission is hereby granted, free of charge, to any person obtaining \na copy of this software and associated documentation files (the \"Software\"), \nto deal in the Software without restriction, including without limitation \nthe rights to use, copy, modify, merge, publish, distribute, sublicense, \nand/or sell copies of the Software, and to permit persons to whom the Software \nis furnished to do so, subject to the following conditions: \nThe above copyright notice and this permission notice shall be included in \nall copies or substantial portions of the Software. \nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, \nEXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF \nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. \nIN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, \nDAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, \nTORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH \nTHE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\n*/\n\nvoid mainImage( out vec4 fragColor, in vec2 fragCoord )\n{\n    // Initialize two colors, black and white\n    vec4 colA = vec4(0.0, 0.0, 0.0, 1.0);\n    vec4 colB = vec4(1.0, 1.0, 1.0, 1.0);\n\n    // Generate a random value between 0 and 1\n    float random = fract(sin(dot(fragCoord.xy, vec2(2.9898, 78.233))) * 43758.5453);\n\n    // Get a random direction vector\n    vec2 randomDir = vec2(sin(random), cos(random));\n\n    // Offset the fragment coordinate using the random direction\n    vec2 offsetCoord = fragCoord + randomDir * iTime * 0.03;\n\n    // Generate another random value\n    float random2 = fract(sin(dot(offsetCoord, vec2(2.9898, 0.233))) * 8.5453);\n\n    // Use the second random value to mix between the two colors\n    fragColor = mix(colA, colB, random2);\n}\n\n/*\nIn this code, the iTime value is used to animate the movement of the pattern. \nEvery frame, the fragment coordinate is offset in a random direction \nby iTime * 20.0, and a new random value is generated based on the offset \ncoordinate. The new random value is then used to mix between the two colors, \nblack and white. This gives the appearance of the pattern moving randomly \nin all directions.\n*/\n","name":"Image","description":"","type":"image"}]}