{"ver":"0.1","info":{"id":"M3fSRH","date":"1709143452","viewed":114,"name":"Hello, world! (obfuscated)","username":"Boogaloo","description":"\"Hello, world!\" except I've rendered it unreadable for no particular reason.","likes":3,"published":1,"flags":0,"usePreview":0,"tags":["obfuscation"],"hasliked":0,"parentid":"M3fSz8","parentname":"Hello, world! (template)"},"renderpass":[{"inputs":[{"id":"4dXGzr","filepath":"/media/a/08b42b43ae9d3c0605da11d0eac86618ea888e62cdd9518ee8b9097488b31560.png","previewfilepath":"/media/ap/08b42b43ae9d3c0605da11d0eac86618ea888e62cdd9518ee8b9097488b31560.png","type":"texture","channel":0,"sampler":{"filter":"mipmap","wrap":"repeat","vflip":"true","srgb":"false","internal":"byte"},"published":1}],"outputs":[{"id":"4dfGRr","channel":0}],"code":"#define lll (\n#define ll1 )\n#define l1l .\n#define l11 vec2\n#define SSS +\n#define SS5 -\n#define S5S =\n#define S55 ;\n\nfloat S2S(float SS2){SS2 S5S floor lll SS2 ll1 S55 float S22 S5S 0. S55 while \nlll SS2 !=1. ll1 {mod(SS2,2.)==0.?SS2*=.5:SS2 S5S SS2*3. SSS 1. S55 S22++ S55}return S22 \nS55}vec4 l1 lll l11 t, l11 p, l11 l ll1{l11 r S5S t SS5 p S55 if lll min \nlll r l1l x,r l1l y ll1>0.&&max lll r l1l x,r l1l y ll1<64. ll1{return vec4 \nlll texelFetch lll iChannel0,ivec2 lll r SSS l* S2S lll 673. ll1 ll1 ,0 ll1 l1l x ll1 S55}\nreturn vec4 lll 0. ll1 S55} void mainImage lll out vec4 O, in vec2 I ll1{l11 \nll S5S l11 lll iResolution l1l x*.5 SS5 S2S lll 7785. ll1, iResolution l1l y*.5 SS5 S2S lll \n57. ll1 ll1 S55 O S5S vec4 lll 0. ll1 SSS l1 lll I,ll, l11 lll S2S lll 6. ll1, S2S lll \n48. ll1 ll1 ll1 SSS l1 lll I, l11 lll ll l1l x SSS S2S lll 57. ll1 ,ll l1l y ll1, l11 \nlll S2S lll 5. ll1, S2S lll 13. ll1 ll1 ll1 SSS l1 lll I, l11 lll ll l1l x SSS S2S lll \n673. ll1 ,ll l1l y ll1, l11 lll S2S lll 17. ll1, S2S lll 12. ll1 ll1 ll1 SSS l1 lll I, l11 \nlll ll l1l x SSS S2S lll 242. ll1 ,ll l1l y ll1, l11 lll S2S lll 104. ll1, S2S lll \n80. ll1 ll1 ll1 SSS l1 lll I, l11 lll ll l1l x SSS S2S lll 457. ll1 ,ll l1l y ll1, \nl11 lll S2S lll 22. ll1, S2S lll 85. ll1 ll1 ll1 SSS l1 lll I, l11 lll ll l1l x SSS S2S \nlll 5345. ll1 ,ll l1l y ll1, l11 lll S2S lll 96. ll1, S2S lll 34. ll1 ll1 ll1\nSSS l1 lll I, l11 lll ll l1l x SSS S2S lll 20174. ll1 ,ll l1l y ll1, l11 lll \nS2S lll 3. ll1, S2S lll 6. ll1 ll1 ll1 SSS l1 lll I, l11 lll ll l1l x SSS S2S lll \n6943. ll1 ,ll l1l y ll1, l11 lll S2S lll 22. ll1, S2S lll 12. ll1 ll1 ll1\nSSS l1 lll I, l11 lll ll l1l x SSS S2S lll 80097. ll1 ,ll l1l y ll1, l11 lll S2S \nlll 4. ll1, S2S lll 256. ll1 ll1 ll1 SSS l1 lll I, l11 lll ll l1l x SSS S2S lll 9159. \nll1 SSS S2S lll 514. ll1,ll l1l y ll1, l11 lll S2S lll 17. ll1, S2S lll 512. ll1 ll1 ll1\nSSS l1 lll I, l11 lll ll l1l x SSS S2S lll 15131. ll1 SSS S2S lll 609. ll1,ll l1l y ll1, \nl11 lll S2S lll 16. ll1, S2S lll 84. ll1 ll1 ll1 SSS l1 lll I, l11 lll ll l1l x SSS S2S \nlll 27. ll1 SSS S2S lll 19593. ll1,ll l1l y ll1, l11 lll S2S lll 2. ll1, S2S lll 34. ll1 ll1 ll1 S55}","name":"Image","description":"","type":"image"}]}