{"ver":"0.1","info":{"id":"MflXD2","date":"1707732450","viewed":22,"name":"[inspirnathan] 01 - circles&anim","username":"hrst4","description":"[inspirnathan] 01 - circles&anim","likes":0,"published":1,"flags":0,"usePreview":0,"tags":["inspirnathan"],"hasliked":0,"parentid":"","parentname":""},"renderpass":[{"inputs":[],"outputs":[{"id":"4dfGRr","channel":0}],"code":"// This a french translation of the highly educational Nathan Vaughn's tutorials.\n// Un grand merci à lui !\n// his website: https://inspirnathan.com/\n// original:\n// from https://inspirnathan.com/posts/48-shadertoy-tutorial-part-2\n\n#define PART 6\n\n\n// moitié de l'écran en blanc\n#if PART == 1 \nvoid mainImage( out vec4 fragColor, in vec2 fragCoord )\n{\n  vec2 uv = fragCoord/iResolution.xy; // range: <0,1>\n\n  vec3 col = vec3(.2); // start avec du noir\n  \n  if (uv.x > .5) col = vec3(1); // moitié droite en blanc\n\n  fragColor = vec4(col,1.0);\n}\n\n#elif PART == 2 // méthode step sur un float\n/*\nLa fonction step accepte deux entrées : le bord de la fonction step et une valeur \nutilisée pour générer la fonction step.\nSi le deuxième paramètre de l'argument de la fonction est supérieur au premier, \nla fonction renvoie la valeur 1. Dans le cas contraire, elle renvoie la valeur zéro.\n\nVous pouvez également exécuter la fonction step sur chaque composant d'un vecteur :\n*/\nvoid mainImage( out vec4 fragColor, in vec2 fragCoord )\n{\n  vec2 uv = fragCoord/iResolution.xy; // <0,1>\n\n  vec3 col = vec3(0.); // start with black\n  \n  col = vec3(step(0.5, uv.x)); // make the right half of the canvas white\n\n  // Output to screen\n  fragColor = vec4(col,1.0);\n}\n#elif PART == 3 // méthode step sur un vecteur\nvoid mainImage( out vec4 fragColor, in vec2 fragCoord )\n{\n  vec2 uv = fragCoord/iResolution.xy; // <0,1>\n\n  vec3 col = vec3(0); // start with black\n  \n  col = vec3(step(0.5, uv), 0.); // perform step function across the x-component and y-component of uv\n\n  // Output to screen\n  /*\n  Puisque la fonction step opère à la fois sur la composante X et la composante Y du canvas,\n  vous devriez voir le canevas se diviser en quatre couleurs.\n  */\n  fragColor = vec4(col,1.0);\n}\n\n#elif PART == 4 // dessiner des cercles\n/*\nL'équation d'un cercle est définie par la formule suivante :\n\nx^2 + y^2 = r^2\n\nx = x-coordinate on graph\ny = y-coordinate on graph\nr = radius of circle\n\nNous pouvons réarranger les variables pour que l'équation soit égale à zéro :\nx^2 + y^2 - r^2 = 0\n\nPour visualiser ce phénomène sur un graphique, \nvous pouvez utiliser la calculatrice Desmos pour tracer le graphique suivant :\n\nx^2 + y^2 - 4 = 0\n\nDans Shadertoy, nous pouvons utiliser le côté gauche (LHS) de cette équation pour \ncréer un cercle.\nCréons une fonction appelée sdfCircle qui renvoie la couleur blanche pour chaque pixel \nà une coordonnée XY telle que l'équation est supérieure à zéro et la couleur bleue \ndans le cas contraire.\n\nLa partie sdf de la fonction fait référence à un concept appelé fonctions de distance \nsignées (SDF), également appelées champs de distance signés.\nIl est plus courant d'utiliser les SDF pour dessiner en 3D, \nmais j'utiliserai également ce terme pour les formes en 2D.\n\nNous appellerons notre nouvelle fonction dans la fonction mainImage pour l'utiliser.\n*/\n\nvec3 sdfCircle(vec2 uv, float r) {\n    float x = uv.x;\n    float y = uv.y;\n    \n    float d = length(vec2(x, y)) - r;\n    \n    return d > 0. ? vec3(1.) : vec3(0., 0., 1.);\n}\n\nvoid mainImage( out vec4 fragColor, in vec2 fragCoord )\n{\n  vec2 uv = fragCoord/iResolution.xy; // <0,1>\n  \n  // décommenter pour obtenir la coordonnée (0,0) au centre\n  uv -= 0.5; // <-0.5, 0.5>\n  // aspect ratio\n  uv.x *= iResolution.x/iResolution.y; // fix aspect ratio\n\n  \n  vec3 col = sdfCircle(uv, .2); // Call this function on each pixel to check if the coordinate lies inside or outside of the circle\n\n  // Output to screen\n  fragColor = vec4(col,1.0);\n}\n\n/*\nSi vous vous demandez pourquoi j'utilise 0. au lieu de 0 sans décimale,\nc'est parce que l'ajout d'une décimale à la fin d'un nombre entier lui donne le \ntype float au lieu de int. Lorsque vous utilisez des fonctions qui requièrent \ndes nombres de type float, placer une décimale à la fin d'un entier est le moyen \nle plus simple de satisfaire le compilateur.\n\nNous utilisons un rayon de 0.2 parce que notre système de coordonnées est \nconfiguré pour n'avoir que des valeurs UV comprises entre zéro et un. \nLorsque vous exécutez le code, vous remarquez que quelque chose ne va pas.\n\nIl semble y avoir un quart de point bleu dans le coin inférieur gauche de la toile.\nPourquoi ? Parce que notre système de coordonnées est actuellement configuré de\ntelle sorte que l'origine se trouve dans le coin inférieur gauche. \nNous devons décaler chaque valeur de 0,5 pour que l'origine du système\nde coordonnées soit au centre de la toile.\n\nSoustrayez 0,5 des coordonnées UV :\nvec2 uv = fragCoord/iResolution.xy; // <0,1>\nuv -= 0.5; // <-0.5, 0.5>\n\nLa plage est maintenant comprise entre -0,5 et 0,5 sur les axes x et y, \nce qui signifie que l'origine du système de coordonnées se trouve au centre de la toile.\nCependant, nous sommes confrontés à un autre problème...\n\nNotre cercle est un peu étiré et ressemble davantage à une ellipse. \nCela est dû au rapport d'aspect du canvas.\nLorsque la largeur et la hauteur du canevas ne correspondent pas, \nle cercle apparaît étiré. Nous pouvons résoudre ce problème en multipliant \nla composante X des coordonnées UV par le rapport d'aspect de la toile.\n\nuv.x *= iResolution.x/iResolution.y; // fix aspect ratio\n\nCela signifie que la composante X n'est plus comprise entre -0,5 et 0,5.\nIl passera par des valeurs proportionnelles au rapport d'aspect de votre toile,\nqui sera déterminé par la largeur de votre navigateur ou de votre page web \n(si vous utilisez quelque chose comme Chrome DevTools pour modifier la largeur).\n\n*/\n\n#elif PART == 5 // animer la couleur du cercle\n/*\nNous pouvons nous amuser avec cela ! \nNous pouvons utiliser la variable globale iTime pour changer de couleur au fil du temps.\nEn utilisant une fonction cosinus (cos),\nnous pouvons faire défiler le même ensemble de couleurs à plusieurs reprises. \nComme les fonctions cosinus oscillent entre les valeurs -1 et 1, \nnous devons ajuster cette plage à des valeurs comprises entre zéro et un.\n\nN'oubliez pas que toutes les valeurs de couleur du fragment final qui sont inférieures\nà zéro seront automatiquement bloquées à zéro.\nDe même, toute valeur de couleur supérieure à un sera limitée à un.\nEn ajustant la plage, nous obtenons une plus large gamme de couleurs.\n\n*/\n\nvec3 sdfCircle(vec2 uv, float r) {\n  float x = uv.x;\n  float y = uv.y;\n  \n  float d = length(vec2(x, y)) - r;\n  \n  return d > 0. ? vec3(0.) : 0.5 + 0.5 * cos(iTime + uv.xyx + vec3(0,2,4));\n}\n\nvoid mainImage( out vec4 fragColor, in vec2 fragCoord )\n{\n  vec2 uv = fragCoord/iResolution.xy; // <0,1>\n  uv -= 0.5;\n  uv.x *= iResolution.x/iResolution.y; // fix aspect ratio\n  \n  vec3 col = sdfCircle(uv, .2);\n\n  // Output to screen\n  fragColor = vec4(col,1.0);\n}\n\n/*\nLa syntaxe de uv.xyx peut vous déconcerter. \nC'est ce qu'on appelle le Swizzling. \nNous pouvons créer de nouveaux vecteurs en utilisant les composantes d'une variable. \nPrenons un exemple.\n\nvec3 col = vec3(0.2, 0.4, 0.6);\nvec3 col2 = col.xyx;\nvec3 col3 = vec3(0.2, 0.4, 0.2);\n// col2 et col3 sont identiques\n\n*/\n\n#elif PART == 6 // faire bouger le cercle\n/*\nPour déplacer le cercle, nous devons appliquer un décalage aux coordonnées XY \nà l'intérieur de l'équation d'un cercle. \nPar conséquent, notre équation ressemblera à ce qui suit :\n\n(x - offsetX)^2 + (y - offsetY)^2 - r^2 = 0\n\nx = x-coordinate on graph\ny = y-coordinate on graph\nr = radius of circle\noffsetX = how much to move the center of the circle in the x-axis\noffsetY = how much to move the center of the circle in the y-axis\n\nDans Desmos:\n(x - 2)^2 + (y - 2)^2 - 4 = 0\nDans Shadertoy, nous pouvons ajuster notre fonction sdfCircle \npour autoriser les décalages et déplacer le centre du cercle de 0,2.\n\nVous pouvez à nouveau utiliser la variable globale iTime à certains \nendroits pour donner vie à votre toile et animer votre cercle.\n*/\n\nvec3 sdfCircle(vec2 uv, float r, vec2 offset) {\n  float x = uv.x - offset.x;\n  float y = uv.y - offset.y;\n  \n  float d = length(vec2(x, y)) - r;\n  \n  return d > 0. ? vec3(1.) : vec3(0., 0., 1.);\n}\n\nvoid mainImage( out vec4 fragColor, in vec2 fragCoord )\n{\n  vec2 uv = fragCoord/iResolution.xy; // <0,1>\n  uv -= 0.5;\n  uv.x *= iResolution.x/iResolution.y; // fix aspect ratio\n  \n  vec2 offset = vec2(sin(iTime*2.)*0.2, cos(iTime*2.)*0.2); // move the circle clockwise\n  \n  vec3 col = sdfCircle(uv, .2, offset);\n\n  // Output to screen\n  fragColor = vec4(col,1.0);\n}\n/*\nLe code ci-dessus déplace le cercle le long d'une trajectoire circulaire\ndans le sens des aiguilles d'une montre, comme s'il tournait autour de l'origine.\nEn multipliant iTime par une valeur, vous pouvez accélérer l'animation.\nEn multipliant la sortie de la fonction sinus ou cosinus par une valeur, \nvous pouvez contrôler la distance entre le cercle et le centre de la toile. \nVous utiliserez beaucoup les fonctions sinus et cosinus avec iTime car elles\ncréent une oscillation.\n*/\n\n/*\nConclusion:\nDans cette leçon, nous avons appris à fixer le système de coordonnées du canvas,\nà dessiner un cercle et à animer le cercle le long d'une trajectoire circulaire. \nDes cercles, des cercles, des cercles ! 🔵\n\nDans la prochaine leçon, je vous montrerai comment dessiner un carré à l'écran.\nEnsuite, nous apprendrons à le faire pivoter !\n*/\n\n#endif\n","name":"Image","description":"","type":"image"}]}