{"ver":"0.1","info":{"id":"Wlyyzt","date":"1611517591","viewed":137,"name":"NickyDrinks Magic Plasma Field","username":"NickyDrinks","description":"I'm not breaking the laws of physics or graphics but it compiles and works. It took me 3 hours to realise the calculations went nowhere but the fps was super high and I bet David Copperfield probably couldn't even fly the first time he jumped.","likes":0,"published":1,"flags":0,"usePreview":0,"tags":["tutorial","plasma","beginner","easy","firstshader","commented","power","nickydrinks","nopascal2d"],"hasliked":0,"parentid":"","parentname":""},"renderpass":[{"inputs":[],"outputs":[{"id":"4dfGRr","channel":0}],"code":"// Hello, this is NickyDrinks off Street Fighter 3 online from about 2007. Let's draw a plasma and try not to melt our eyes \n// I reckon this effect is a good place to start with HLSL because nobody wants to start off with a shape that just sits there doing nothing\n// Probably best not to copy exactly what I've done because with 3D graphics I tend to hard-code \"fixes\" that come back to haunt me. This is actually all 2D though so it'll be fine.\n// Anything with the two forward slashes is ignored so you can write whatever you want and the compiler can do nothing about it, not a thing\n// There's more commenting here than there is actual code, our old lecturer would either be super pleased or raging\n// Who lectures in graphics coding then runs the stuff in software mode anyway? I didn't know he didn't even have a Voodoo 1 never mind a Voodoo 2 \n\nfloat pi = 3.1415926535897932384626433832795; // Here we speak to the machine, and it hears us telling it what we want something called pi to be. Wnat is pi? Who cares! You could waste time calculating it but adding more accuracy only leads to misery.\n\nvoid mainImage( out vec4 fragColor, in vec2 fragCoord )  // tell the machine that it's time to start the shading, actual graphics, the plasma coils are warming up\n\n{\n \nfloat hue; // It's the value of Red, Green and Blue that we're changing but I'd already used \"hue\" all over the place so just kept it, newcol or something may have been even faster\n// float x = (iResolution.x)*1.0;    // I can comment out the worst code in the world and the compiler is powerless to stop me\n// float y = (iResolution.y)*1.0;    // At some point I was going to use seperate x and y variables and then copy that to uv.x and uv.y but I changed my mind\n\nvec2 uv = vec2(fragCoord/iResolution.xy-0.4); //normalise xy coords to (0,1) so that the thing will actually work and copy them into vec2 uv so you can point at them with uv.x and uv.y and do all maths and stuff.....then maybe add or subtract a bit after you've written the rest of the code just to \"adjust\" things\n// All that does is stop the numbers going above 1 or below -1, it sounds cooler the other way though and makes sense because you don't know what resolution it'll be running in so this way it looks the same no matter where it runs (mostly). Y is up, anyone who says different is wrong, sort of like how North is up and South is down.\n   \nuv+=(sin(uv.x*3.5+iTime)); //generate a SINUSOID (the main ingredient of pure plasma power) on the x-axis, also add the current value of Time to start giving us movement because it's a value that will change each time this code is run and it'll run faster than you think. Way faster than that even. Faster.\n//uv+=(sin(uv.y*1.0+iTime));  // Surely doing the same on the other axis will mean it is twice as good? Not exactly but if you remove the comment tags it'll change...values\n   \nuv+= sin(2.5*(uv.x*sin(iTime/2.0)+uv.y*cos(iTime/2.0))+iTime); // Do some more sin and cos on x and y coords, now we are building up the plasma power like it's 1990. \n\n// From here onwards we can clearly see the initial work infering that, given Junglist as a singular set, there should exist a linear model where iteration results in a level of massivity previously observed or estimated at live events (Simenon et al., 1988) \n\nhue=(sin(7.0*(sqrt(pow(uv.x, 2.0) + pow(uv.y, 2.0)) + (0.5 + iTime)/2.0)-1.5)); //This is it, the big one, the main event. The actual equation looks complicated but when you look at it broken up into a series of calculations it's really not. Try different values for approx 1 hour to dial in maximum power\n\n// You can put anything in here and it'll just ignore it. You could even just delete it or add wisdom from Coolio : \n// \"Power and the money, money and the power\n//  Minute after minute, hour after hour\n//  Everybody's runnin', but half of them ain't lookin'\n//  It's goin' on in the kitchen, but I don't know what's cookin'\"\n\nvec3 col = vec3(sin(hue*pi)+.7, sin(hue*pi+2.0*pi/3.0)+0.4, sin(hue*pi+4.0*pi/3.0)); // Unleash the power of mother nature finally bent to your will to change the numbers, giving us a new value and then just sort of steer it towards Groove Is In The Heart\n\nfragColor = vec4(col,1.0); // Unlike Coolio we know that we've been cooking so we copy our new value into vec4 and fire it out of the GPU directly into the viewer's eyes and mind using electricity, BANG! We have transformed boring numbers into raw graphics magic!\n}  \n// Don't delete the \"}\" in the line above by accident or you will enrage the compiler and make it refuse to activate the plasma power hidden inside the computer\n\n// That's it, from there it goes back and does the whole thing again for every single pixel (each pixel comes in claiming to be called \"fragCoord\" but with a different value of X and Y so it covers all the places where it can draw stuff, if anyone asks call it a canvas and not a screen or you'll attract the really mad Linux people, the ones with no plasma power. It just keeps doing that until either the universe ends or you close the browse. Which will happen first? Who can say.\n// It may look absolutely awful initially but since iTime is in there with some sin'ing and cos'ing all over the show it'll still be animated\n// Now just think up some other effects and you are ready for Assembly, if you need music just download something like Renoise and play random bits of the Amen break\n// Don't add in any code written in Pascal unless you are Trug who used to be in Future Crew making a surprise comeback or revealing The Probe like they did with Panic but much more elaborate.\n// If at any point a change you make gives a better looking effect then keep it because it means you have improved the code and increased the power going to the plasma coils or the TARDIS or something.\n// If you think this editor is frustrating you should give POV-Ray a go in DOS using edit.com. The preview window was inside your head and the pixels didn't come up as fast.\n// Be glad that you decided against glslsandbox because no matter how horrible the graphics are at least they won't fill your entire field of vision and make you feel like you are about to die.\n// Now it's time to start a brand new shader and make an effect nobody has ever seen before, most stuff has already been done with either particles, voxels (or whatever they're called now), good old polygons or a mixture of them all so that's quite hard but I believe in you, like a rubbish Splinter who only really knows one move.\n// Warmest Regards,\n// NickyDrinks.\n\n\n\n\n\n// I did a quick port over to GLSL just out of interest to see what that was like. I think I'll stick with this \n// Easier debugging on there but ruined by the absolutely insane choice not to allow an opaque editing window, unless I'm missing something which is 100% likely. Seeing parented code side by side with another? No problem. Readable text? No chance.\n// http://glslsandbox.com/e#70904.2\n\n// If you ever want a laugh try and follow Nvidia's documentation, at least it's a good example of how not to do anything. Never follow it, there's always a bit at the end that tells you it's out of date and even that's out of date or just actual bollocks. \n// Who doesn't include cuda drivers in the dev image of a box that only exists because it has cuda cores? The same people who sell Nintendo chips with a known, totally unpatchable exploit, I bet it was on that hellish website somewhere, behind an old Voodoo 3 box design maybe. Christ almighty it's so bad, you get different pages depending on what angle you approach from. I dread to think what's on there that shouldn't be.\n// \"Don't let our super secret compiler out!\" Then don't whack it in a zip file and send it to everyone who makes the mistake of installing your \"experience\"! At least it was still totally broken so of no use to anyone.\n// Clang took one look at \"Jarvis\" and crashed Windows just to save time, 50GB of memory it was willing to take down with it. And it was right.\n// Give your computer the powers of a drunken, confused Tony Stark and Paul Bettany if he was a calculator from 1989","name":"Image","description":"","type":"image"}]}